; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-7-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p0-2 - location
	p0-3 - location
	p0-6 - location
	p1-5 - location
	p2-3 - location
	p2-4 - location
	p2-6 - location
	p2-7 - location
	p2-8 - location
	p2-9 - location
	p2-11 - location
	p3-1 - location
	p4-11 - location
	p5-6 - location
	p6-0 - location
	p7-10 - location
	p8-5 - location
	p9-3 - location
	p10-4 - location
	p10-12 - location
	p11-8 - location
	p12-2 - location
	p12-6 - location
	p12-8 - location
	)
	(:init
	(at driver1 s10)
	(at driver2 s10)
	(at driver3 s9)
	(at truck1 s8)
	(empty truck1)
	(at truck2 s11)
	(empty truck2)
	(at truck3 s7)
	(empty truck3)
	(at truck4 s12)
	(empty truck4)
	(at truck5 s4)
	(empty truck5)
	(at truck6 s4)
	(empty truck6)
	(at truck7 s10)
	(empty truck7)
	(at package1 s4)
	(at package2 s0)
	(at package3 s5)
	(at package4 s8)
	(at package5 s12)
	(at package6 s3)
	(at package7 s4)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 87)
	(= (time-to-walk p0-2 s0) 87)
	(= (time-to-walk s2 p0-2) 46)
	(= (time-to-walk p0-2 s2) 46)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 81)
	(= (time-to-walk p0-3 s0) 81)
	(= (time-to-walk s3 p0-3) 86)
	(= (time-to-walk p0-3 s3) 86)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 77)
	(= (time-to-walk p0-6 s0) 77)
	(= (time-to-walk s6 p0-6) 19)
	(= (time-to-walk p0-6 s6) 19)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 52)
	(= (time-to-walk p1-5 s1) 52)
	(= (time-to-walk s5 p1-5) 57)
	(= (time-to-walk p1-5 s5) 57)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 4)
	(= (time-to-walk p2-3 s2) 4)
	(= (time-to-walk s3 p2-3) 67)
	(= (time-to-walk p2-3 s3) 67)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 89)
	(= (time-to-walk p2-4 s2) 89)
	(= (time-to-walk s4 p2-4) 70)
	(= (time-to-walk p2-4 s4) 70)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(= (time-to-walk s2 p2-6) 24)
	(= (time-to-walk p2-6 s2) 24)
	(= (time-to-walk s6 p2-6) 92)
	(= (time-to-walk p2-6 s6) 92)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(= (time-to-walk s2 p2-7) 12)
	(= (time-to-walk p2-7 s2) 12)
	(= (time-to-walk s7 p2-7) 76)
	(= (time-to-walk p2-7 s7) 76)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(= (time-to-walk s2 p2-8) 33)
	(= (time-to-walk p2-8 s2) 33)
	(= (time-to-walk s8 p2-8) 24)
	(= (time-to-walk p2-8 s8) 24)
	(path s2 p2-9)
	(path p2-9 s2)
	(path s9 p2-9)
	(path p2-9 s9)
	(= (time-to-walk s2 p2-9) 56)
	(= (time-to-walk p2-9 s2) 56)
	(= (time-to-walk s9 p2-9) 100)
	(= (time-to-walk p2-9 s9) 100)
	(path s2 p2-11)
	(path p2-11 s2)
	(path s11 p2-11)
	(path p2-11 s11)
	(= (time-to-walk s2 p2-11) 5)
	(= (time-to-walk p2-11 s2) 5)
	(= (time-to-walk s11 p2-11) 20)
	(= (time-to-walk p2-11 s11) 20)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 96)
	(= (time-to-walk p3-1 s3) 96)
	(= (time-to-walk s1 p3-1) 70)
	(= (time-to-walk p3-1 s1) 70)
	(path s4 p4-11)
	(path p4-11 s4)
	(path s11 p4-11)
	(path p4-11 s11)
	(= (time-to-walk s4 p4-11) 57)
	(= (time-to-walk p4-11 s4) 57)
	(= (time-to-walk s11 p4-11) 26)
	(= (time-to-walk p4-11 s11) 26)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 89)
	(= (time-to-walk p5-6 s5) 89)
	(= (time-to-walk s6 p5-6) 86)
	(= (time-to-walk p5-6 s6) 86)
	(path s7 p7-10)
	(path p7-10 s7)
	(path s10 p7-10)
	(path p7-10 s10)
	(= (time-to-walk s7 p7-10) 59)
	(= (time-to-walk p7-10 s7) 59)
	(= (time-to-walk s10 p7-10) 3)
	(= (time-to-walk p7-10 s10) 3)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(= (time-to-walk s8 p8-5) 50)
	(= (time-to-walk p8-5 s8) 50)
	(= (time-to-walk s5 p8-5) 46)
	(= (time-to-walk p8-5 s5) 46)
	(path s9 p9-3)
	(path p9-3 s9)
	(path s3 p9-3)
	(path p9-3 s3)
	(= (time-to-walk s9 p9-3) 48)
	(= (time-to-walk p9-3 s9) 48)
	(= (time-to-walk s3 p9-3) 30)
	(= (time-to-walk p9-3 s3) 30)
	(path s10 p10-4)
	(path p10-4 s10)
	(path s4 p10-4)
	(path p10-4 s4)
	(= (time-to-walk s10 p10-4) 31)
	(= (time-to-walk p10-4 s10) 31)
	(= (time-to-walk s4 p10-4) 24)
	(= (time-to-walk p10-4 s4) 24)
	(path s10 p10-12)
	(path p10-12 s10)
	(path s12 p10-12)
	(path p10-12 s12)
	(= (time-to-walk s10 p10-12) 48)
	(= (time-to-walk p10-12 s10) 48)
	(= (time-to-walk s12 p10-12) 83)
	(= (time-to-walk p10-12 s12) 83)
	(path s11 p11-8)
	(path p11-8 s11)
	(path s8 p11-8)
	(path p11-8 s8)
	(= (time-to-walk s11 p11-8) 81)
	(= (time-to-walk p11-8 s11) 81)
	(= (time-to-walk s8 p11-8) 52)
	(= (time-to-walk p11-8 s8) 52)
	(path s12 p12-2)
	(path p12-2 s12)
	(path s2 p12-2)
	(path p12-2 s2)
	(= (time-to-walk s12 p12-2) 50)
	(= (time-to-walk p12-2 s12) 50)
	(= (time-to-walk s2 p12-2) 69)
	(= (time-to-walk p12-2 s2) 69)
	(path s12 p12-6)
	(path p12-6 s12)
	(path s6 p12-6)
	(path p12-6 s6)
	(= (time-to-walk s12 p12-6) 21)
	(= (time-to-walk p12-6 s12) 21)
	(= (time-to-walk s6 p12-6) 74)
	(= (time-to-walk p12-6 s6) 74)
	(path s12 p12-8)
	(path p12-8 s12)
	(path s8 p12-8)
	(path p12-8 s8)
	(= (time-to-walk s12 p12-8) 61)
	(= (time-to-walk p12-8 s12) 61)
	(= (time-to-walk s8 p12-8) 33)
	(= (time-to-walk p12-8 s8) 33)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 50)
	(= (time-to-drive s3 s0) 50)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 93)
	(= (time-to-drive s4 s0) 93)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 56)
	(= (time-to-drive s8 s0) 56)
	(link s0 s12)
	(link s12 s0)
	(= (time-to-drive s0 s12) 5)
	(= (time-to-drive s12 s0) 5)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 92)
	(= (time-to-drive s0 s2) 92)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 61)
	(= (time-to-drive s5 s2) 61)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 25)
	(= (time-to-drive s8 s2) 25)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 87)
	(= (time-to-drive s11 s2) 87)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 30)
	(= (time-to-drive s1 s3) 30)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 81)
	(= (time-to-drive s2 s3) 81)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 13)
	(= (time-to-drive s4 s3) 13)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 19)
	(= (time-to-drive s10 s3) 19)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 67)
	(= (time-to-drive s7 s4) 67)
	(link s4 s10)
	(link s10 s4)
	(= (time-to-drive s4 s10) 71)
	(= (time-to-drive s10 s4) 71)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 22)
	(= (time-to-drive s11 s4) 22)
	(link s4 s12)
	(link s12 s4)
	(= (time-to-drive s4 s12) 16)
	(= (time-to-drive s12 s4) 16)
	(link s5 s10)
	(link s10 s5)
	(= (time-to-drive s5 s10) 16)
	(= (time-to-drive s10 s5) 16)
	(link s5 s11)
	(link s11 s5)
	(= (time-to-drive s5 s11) 69)
	(= (time-to-drive s11 s5) 69)
	(link s5 s12)
	(link s12 s5)
	(= (time-to-drive s5 s12) 45)
	(= (time-to-drive s12 s5) 45)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 47)
	(= (time-to-drive s2 s6) 47)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 93)
	(= (time-to-drive s9 s6) 93)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 93)
	(= (time-to-drive s2 s7) 93)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 30)
	(= (time-to-drive s6 s7) 30)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 73)
	(= (time-to-drive s1 s8) 73)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 45)
	(= (time-to-drive s3 s8) 45)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 80)
	(= (time-to-drive s6 s8) 80)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 42)
	(= (time-to-drive s2 s9) 42)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 66)
	(= (time-to-drive s3 s9) 66)
	(link s9 s10)
	(link s10 s9)
	(= (time-to-drive s9 s10) 53)
	(= (time-to-drive s10 s9) 53)
	(link s10 s12)
	(link s12 s10)
	(= (time-to-drive s10 s12) 2)
	(= (time-to-drive s12 s10) 2)
	(link s11 s0)
	(link s0 s11)
	(= (time-to-drive s11 s0) 98)
	(= (time-to-drive s0 s11) 98)
	(link s11 s1)
	(link s1 s11)
	(= (time-to-drive s11 s1) 2)
	(= (time-to-drive s1 s11) 2)
	(link s11 s10)
	(link s10 s11)
	(= (time-to-drive s11 s10) 95)
	(= (time-to-drive s10 s11) 95)
	(link s12 s2)
	(link s2 s12)
	(= (time-to-drive s12 s2) 54)
	(= (time-to-drive s2 s12) 54)
	(link s12 s6)
	(link s6 s12)
	(= (time-to-drive s12 s6) 7)
	(= (time-to-drive s6 s12) 7)
	(link s12 s7)
	(link s7 s12)
	(= (time-to-drive s12 s7) 86)
	(= (time-to-drive s7 s12) 86)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s5)
	(at driver2 s12)
	(at truck2 s9)
	(at truck4 s4)
	(at truck5 s2)
	(at truck6 s5)
	(at package1 s8)
	(at package2 s5)
	(at package3 s1)
	(at package4 s10)
	(at package5 s8)
	(at package6 s2)
	(at package7 s1)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 2  (driven))) (* 3  (walked))))

)

; plan
1. (board-truck driver2 truck7 s10)
   deleted: (at driver2 s10) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 0 of 13
2. (drive-truck truck7 s10 s5 driver2)
   deleted: (at truck7 s10)
   added: (at truck7 s5)
   changed: (driven) from 0 to 16
   goals met: 0 of 13
3. (walk driver1 s10 p10-4)
   deleted: (at driver1 s10)
   added: (at driver1 p10-4)
   changed: (walked) from 0 to 31
   goals met: 0 of 13
4. (load-truck package3 truck7 s5)
   deleted: (at package3 s5)
   added: (in package3 truck7)
   goals met: 0 of 13
5. (walk driver1 p10-4 s4)
   deleted: (at driver1 p10-4)
   added: (at driver1 s4)
   changed: (walked) from 31 to 55
   goals met: 0 of 13
6. (walk driver1 s4 p4-11)
   deleted: (at driver1 s4)
   added: (at driver1 p4-11)
   changed: (walked) from 55 to 112
   goals met: 0 of 13
7. (drive-truck truck7 s5 s12 driver2)
   deleted: (at truck7 s5)
   added: (at truck7 s12)
   changed: (driven) from 16 to 61
   goals met: 0 of 13
8. (walk driver1 p4-11 s11)
   deleted: (at driver1 p4-11)
   added: (at driver1 s11)
   changed: (walked) from 112 to 138
   goals met: 0 of 13
9. (board-truck driver1 truck2 s11)
   deleted: (at driver1 s11) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 0 of 13
10. (load-truck package5 truck7 s12)
   deleted: (at package5 s12)
   added: (in package5 truck7)
   goals met: 0 of 13
11. (drive-truck truck7 s12 s0 driver2)
   deleted: (at truck7 s12)
   added: (at truck7 s0)
   changed: (driven) from 61 to 66
   goals met: 0 of 13
12. (drive-truck truck2 s11 s10 driver1)
   deleted: (at truck2 s11)
   added: (at truck2 s10)
   changed: (driven) from 66 to 161
   goals met: 0 of 13
13. (drive-truck truck2 s10 s3 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s3)
   changed: (driven) from 161 to 180
   goals met: 0 of 13
14. (drive-truck truck7 s0 s12 driver2)
   deleted: (at truck7 s0)
   added: (at truck7 s12)
   changed: (driven) from 180 to 185
   goals met: 0 of 13
15. (drive-truck truck2 s3 s8 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s8)
   changed: (driven) from 185 to 230
   goals met: 0 of 13
16. (drive-truck truck7 s12 s4 driver2)
   deleted: (at truck7 s12)
   added: (at truck7 s4)
   changed: (driven) from 230 to 246
   goals met: 0 of 13
17. (load-truck package1 truck7 s4)
   deleted: (at package1 s4)
   added: (in package1 truck7)
   goals met: 0 of 13
18. (load-truck package7 truck7 s4)
   deleted: (at package7 s4)
   added: (in package7 truck7)
   goals met: 0 of 13
19. (load-truck package4 truck2 s8)
   deleted: (at package4 s8)
   added: (in package4 truck2)
   goals met: 0 of 13
20. (drive-truck truck2 s8 s2 driver1)
   deleted: (at truck2 s8)
   added: (at truck2 s2)
   changed: (driven) from 246 to 271
   goals met: 0 of 13
21. (drive-truck truck2 s2 s5 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   changed: (driven) from 271 to 332
   goals met: 0 of 13
22. (disembark-truck driver1 truck2 s5)
   deleted: (driving driver1 truck2)
   added: (at driver1 s5) (empty truck2)
   goals met: 1 of 13
23. (drive-truck truck7 s4 s0 driver2)
   deleted: (at truck7 s4)
   added: (at truck7 s0)
   changed: (driven) from 332 to 425
   goals met: 1 of 13
24. (load-truck package2 truck7 s0)
   deleted: (at package2 s0)
   added: (in package2 truck7)
   goals met: 1 of 13
25. (drive-truck truck7 s0 s3 driver2)
   deleted: (at truck7 s0)
   added: (at truck7 s3)
   changed: (driven) from 425 to 475
   goals met: 1 of 13
26. (load-truck package6 truck7 s3)
   deleted: (at package6 s3)
   added: (in package6 truck7)
   goals met: 1 of 13
27. (board-truck driver1 truck2 s5)
   deleted: (at driver1 s5) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 0 of 13
28. (drive-truck truck7 s3 s8 driver2)
   deleted: (at truck7 s3)
   added: (at truck7 s8)
   changed: (driven) from 475 to 520
   goals met: 0 of 13
29. (unload-truck package1 truck7 s8)
   deleted: (in package1 truck7)
   added: (at package1 s8)
   goals met: 1 of 13
30. (drive-truck truck2 s5 s12 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s12)
   changed: (driven) from 520 to 565
   goals met: 1 of 13
31. (drive-truck truck2 s12 s4 driver1)
   deleted: (at truck2 s12)
   added: (at truck2 s4)
   changed: (driven) from 565 to 581
   goals met: 1 of 13
32. (unload-truck package5 truck7 s8)
   deleted: (in package5 truck7)
   added: (at package5 s8)
   goals met: 2 of 13
33. (drive-truck truck7 s8 s2 driver2)
   deleted: (at truck7 s8)
   added: (at truck7 s2)
   changed: (driven) from 581 to 606
   goals met: 2 of 13
34. (unload-truck package6 truck7 s2)
   deleted: (in package6 truck7)
   added: (at package6 s2)
   goals met: 3 of 13
35. (drive-truck truck7 s2 s5 driver2)
   deleted: (at truck7 s2)
   added: (at truck7 s5)
   changed: (driven) from 606 to 667
   goals met: 3 of 13
36. (disembark-truck driver1 truck2 s4)
   deleted: (driving driver1 truck2)
   added: (at driver1 s4) (empty truck2)
   goals met: 3 of 13
37. (unload-truck package4 truck2 s4)
   deleted: (in package4 truck2)
   added: (at package4 s4)
   goals met: 3 of 13
38. (unload-truck package2 truck7 s5)
   deleted: (in package2 truck7)
   added: (at package2 s5)
   goals met: 4 of 13
39. (board-truck driver1 truck2 s4)
   deleted: (at driver1 s4) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 4 of 13
40. (drive-truck truck7 s5 s11 driver2)
   deleted: (at truck7 s5)
   added: (at truck7 s11)
   changed: (driven) from 667 to 736
   goals met: 4 of 13
41. (drive-truck truck7 s11 s1 driver2)
   deleted: (at truck7 s11)
   added: (at truck7 s1)
   changed: (driven) from 736 to 738
   goals met: 4 of 13
42. (load-truck package4 truck2 s4)
   deleted: (at package4 s4)
   added: (in package4 truck2)
   goals met: 4 of 13
43. (unload-truck package3 truck7 s1)
   deleted: (in package3 truck7)
   added: (at package3 s1)
   goals met: 5 of 13
44. (unload-truck package7 truck7 s1)
   deleted: (in package7 truck7)
   added: (at package7 s1)
   goals met: 6 of 13
45. (drive-truck truck7 s1 s8 driver2)
   deleted: (at truck7 s1)
   added: (at truck7 s8)
   changed: (driven) from 738 to 811
   goals met: 6 of 13
46. (disembark-truck driver1 truck2 s4)
   deleted: (driving driver1 truck2)
   added: (at driver1 s4) (empty truck2)
   goals met: 6 of 13
47. (drive-truck truck7 s8 s6 driver2)
   deleted: (at truck7 s8)
   added: (at truck7 s6)
   changed: (driven) from 811 to 891
   goals met: 6 of 13
48. (board-truck driver1 truck2 s4)
   deleted: (at driver1 s4) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 6 of 13
49. (drive-truck truck7 s6 s12 driver2)
   deleted: (at truck7 s6)
   added: (at truck7 s12)
   changed: (driven) from 891 to 898
   goals met: 6 of 13
50. (disembark-truck driver2 truck7 s12)
   deleted: (driving driver2 truck7)
   added: (at driver2 s12) (empty truck7)
   goals met: 7 of 13
51. (drive-truck truck2 s4 s10 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s10)
   changed: (driven) from 898 to 969
   goals met: 7 of 13
52. (unload-truck package4 truck2 s10)
   deleted: (in package4 truck2)
   added: (at package4 s10)
   goals met: 8 of 13
53. (drive-truck truck2 s10 s4 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s4)
   changed: (driven) from 969 to 1040
   goals met: 8 of 13
54. (disembark-truck driver1 truck2 s4)
   deleted: (driving driver1 truck2)
   added: (at driver1 s4) (empty truck2)
   goals met: 8 of 13
55. (board-truck driver1 truck6 s4)
   deleted: (at driver1 s4) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 8 of 13
56. (drive-truck truck6 s4 s12 driver1)
   deleted: (at truck6 s4)
   added: (at truck6 s12)
   changed: (driven) from 1040 to 1056
   goals met: 8 of 13
57. (board-truck driver2 truck4 s12)
   deleted: (at driver2 s12) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 7 of 13
58. (drive-truck truck6 s12 s5 driver1)
   deleted: (at truck6 s12)
   added: (at truck6 s5)
   changed: (driven) from 1056 to 1101
   goals met: 8 of 13
59. (drive-truck truck4 s12 s4 driver2)
   deleted: (at truck4 s12)
   added: (at truck4 s4)
   changed: (driven) from 1101 to 1117
   goals met: 9 of 13
60. (disembark-truck driver2 truck4 s4)
   deleted: (driving driver2 truck4)
   added: (at driver2 s4) (empty truck4)
   goals met: 9 of 13
61. (board-truck driver2 truck5 s4)
   deleted: (at driver2 s4) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 9 of 13
62. (drive-truck truck5 s4 s12 driver2)
   deleted: (at truck5 s4)
   added: (at truck5 s12)
   changed: (driven) from 1117 to 1133
   goals met: 9 of 13
63. (drive-truck truck5 s12 s2 driver2)
   deleted: (at truck5 s12)
   added: (at truck5 s2)
   changed: (driven) from 1133 to 1187
   goals met: 10 of 13
64. (disembark-truck driver2 truck5 s2)
   deleted: (driving driver2 truck5)
   added: (at driver2 s2) (empty truck5)
   goals met: 10 of 13
65. (disembark-truck driver1 truck6 s5)
   deleted: (driving driver1 truck6)
   added: (at driver1 s5) (empty truck6)
   goals met: 11 of 13
66. (walk driver2 s2 p12-2)
   deleted: (at driver2 s2)
   added: (at driver2 p12-2)
   changed: (walked) from 138 to 207
   goals met: 11 of 13
67. (walk driver3 s9 p2-9)
   deleted: (at driver3 s9)
   added: (at driver3 p2-9)
   changed: (walked) from 207 to 307
   goals met: 11 of 13
68. (walk driver2 p12-2 s12)
   deleted: (at driver2 p12-2)
   added: (at driver2 s12)
   changed: (walked) from 307 to 357
   goals met: 12 of 13
69. (walk driver3 p2-9 s2)
   deleted: (at driver3 p2-9)
   added: (at driver3 s2)
   changed: (walked) from 357 to 413
   goals met: 12 of 13
70. (walk driver3 s2 p2-4)
   deleted: (at driver3 s2)
   added: (at driver3 p2-4)
   changed: (walked) from 413 to 502
   goals met: 12 of 13
71. (walk driver3 p2-4 s4)
   deleted: (at driver3 p2-4)
   added: (at driver3 s4)
   changed: (walked) from 502 to 572
   goals met: 12 of 13
72. (board-truck driver3 truck2 s4)
   deleted: (at driver3 s4) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 12 of 13
73. (drive-truck truck2 s4 s10 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s10)
   changed: (driven) from 1187 to 1258
   goals met: 12 of 13
74. (drive-truck truck2 s10 s9 driver3)
   deleted: (at truck2 s10)
   added: (at truck2 s9)
   changed: (driven) from 1258 to 1311
   goals met: 13 of 13
